src/main/resources/doAddSsr_AddCatering.text

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2"><soapenv:Header/><soapenv:Body><ns2:OrderChangeRQ xmlns:ns2="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="IATA2017.2" xsi:schemaLocation="xmldsig-core-schema.xsd"><ns2:Document><ns2:Name>NDCTEST</ns2:Name><ns2:ReferenceVersion>1.0</ns2:ReferenceVersion></ns2:Document><ns2:Party><ns2:Sender><ns2:TravelAgencySender><ns2:Contacts><ns2:Contact><ns2:EmailContact><ns2:Address>a</ns2:Address></ns2:EmailContact></ns2:Contact></ns2:Contacts><ns2:AgencyID>a</ns2:AgencyID><ns2:AgentUser><ns2:Name>a</ns2:Name><ns2:AgentUserID>T621OC48</ns2:AgentUserID><ns2:UserRole>ADMIN</ns2:UserRole></ns2:AgentUser></ns2:TravelAgencySender></ns2:Sender><ns2:Recipient xsi:nil="true"/><ns2:Participants xsi:nil="true"/><ns2:Participants xsi:nil="true"/></ns2:Party><ns2:Query><ns2:OrderID Owner="PC">replaceOrderId</ns2:OrderID><ns2:OrderServicing><ns2:AcceptOffer><ns2:Offer OfferID="Mzc4NjMwNCoxMjY3MjQzNyotMSpUQUdUL0lOVCpUKmZhbHNlKkExNTZGRzY5Ki0xKk9XKnRydWUmMzc1MjE2MioxMjM3NDE5MSotMSpKQU9XL0VDTipKKmZhbHNlKkExNTZGRzY5Ki0xKk9XKnRydWU" Owner="PC" ResponseID="9d3108eb5ae44b25bb258a4d75d560d8"><ns2:OfferItem OfferItemID="replaceOfferItemId"><ns2:PassengerRefs>replacePassengerRefs</ns2:PassengerRefs><ns2:ALaCarteSelection><ns2:Quantity>1</ns2:Quantity><ns2:SegmentID>replaceSegmentId</ns2:SegmentID></ns2:ALaCarteSelection><ns2:ServiceSelection ServiceID="Service1"><ns2:ServiceDefinitionID>replaceServiceDefId</ns2:ServiceDefinitionID></ns2:ServiceSelection></ns2:OfferItem></ns2:Offer></ns2:AcceptOffer></ns2:OrderServicing><ns2:OrderChangeMetadata><ns2:Other><ns2:OtherMetadata><ns2:CurrencyMetadatas><ns2:CurrencyMetadata MetadataKey="TRY"/></ns2:CurrencyMetadatas></ns2:OtherMetadata></ns2:Other></ns2:OrderChangeMetadata></ns2:Query><ns2:DataLists><ns2:PassengerList><ns2:Passenger PassengerID="replacePassengerId"><ns2:PTC>ADT</ns2:PTC><ns2:ResidenceCountryCode>TR</ns2:ResidenceCountryCode><ns2:Individual><ns2:GivenName>CENGIZHAN</ns2:GivenName><ns2:Surname>YILMAZ</ns2:Surname></ns2:Individual></ns2:Passenger></ns2:PassengerList><ns2:ServiceDefinitionList><ns2:ServiceDefinition ServiceDefinitionID="replaceServiceDefId" Owner="PC"><ns2:Name>MAIN CATERING</ns2:Name><ns2:Encoding><ns2:Code>CATERING</ns2:Code></ns2:Encoding><ns2:Descriptions><ns2:Description><ns2:Text>MAIN CATERING</ns2:Text></ns2:Description></ns2:Descriptions></ns2:ServiceDefinition></ns2:ServiceDefinitionList></ns2:DataLists></ns2:OrderChangeRQ></soapenv:Body></soapenv:Envelope>
